Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/qei.h
/* -------- QEI_QEICONSET : (QEI Offset: 0x08) (R/W 32) Bit set register -------- */
#define QEI_QEICONSET_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_QEICONSET) Bit set register  Reset Value */

#define QEI_QEICONSET_Msk                     _UINT32_(0x00000000)                                 /* (QEI_QEICONSET) Register Mask  */


/* -------- QEI_QEICONINV : (QEI Offset: 0x0C) (R/W 32) Bit invert register -------- */
#define QEI_QEICONINV_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_QEICONINV) Bit invert register  Reset Value */

#define QEI_QEICONINV_Msk                     _UINT32_(0x00000000)                                 /* (QEI_QEICONINV) Register Mask  */


/* -------- QEI_QEIIOC : (QEI Offset: 0x10) (R/W 32) QEI I/O Control Register -------- */
#define QEI_QEIIOC_QEA_Pos                    _UINT32_(0)                                          /* (QEI_QEIIOC) Status of QEAx Input Pin after Polarity Control and SWPAB Pin Swapping bit Position */
#define QEI_QEIIOC_QEA_Msk                    (_UINT32_(0x1) << QEI_QEIIOC_QEA_Pos)                /* (QEI_QEIIOC) Status of QEAx Input Pin after Polarity Control and SWPAB Pin Swapping bit Mask */
#define QEI_QEIIOC_QEA(value)                 (QEI_QEIIOC_QEA_Msk & (_UINT32_(value) << QEI_QEIIOC_QEA_Pos)) /* Assigment of value for QEA in the QEI_QEIIOC register */
#define   QEI_QEIIOC_QEA_1_Val                _UINT32_(0x1)                                        /* (QEI_QEIIOC) Status of QEA input pin after polarity control and SWPAB pin swapping  */
#define   QEI_QEIIOC_QEA_0_Val                _UINT32_(0x0)                                        /* (QEI_QEIIOC) Status of QEA input pin after polarity control and SWPAB pin swapping  */
#define QEI_QEIIOC_QEA_1                      (QEI_QEIIOC_QEA_1_Val << QEI_QEIIOC_QEA_Pos)         /* (QEI_QEIIOC) Status of QEA input pin after polarity control and SWPAB pin swapping Position  */
#define QEI_QEIIOC_QEA_0                      (QEI_QEIIOC_QEA_0_Val << QEI_QEIIOC_QEA_Pos)         /* (QEI_QEIIOC) Status of QEA input pin after polarity control and SWPAB pin swapping Position  */
#define QEI_QEIIOC_QEB_Pos                    _UINT32_(1)                                          /* (QEI_QEIIOC) Status of QEBx Input Pin after Polarity Control and SWPAB Pin Swapping bit Position */
#define QEI_QEIIOC_QEB_Msk                    (_UINT32_(0x1) << QEI_QEIIOC_QEB_Pos)                /* (QEI_QEIIOC) Status of QEBx Input Pin after Polarity Control and SWPAB Pin Swapping bit Mask */
#define QEI_QEIIOC_QEB(value)                 (QEI_QEIIOC_QEB_Msk & (_UINT32_(value) << QEI_QEIIOC_QEB_Pos)) /* Assigment of value for QEB in the QEI_QEIIOC register */
#define   QEI_QEIIOC_QEB_1_Val                _UINT32_(0x1)                                        /* (QEI_QEIIOC) Status of QEB input pin after polarity control and SWPAB pin swapping  */
#define   QEI_QEIIOC_QEB_0_Val                _UINT32_(0x0)                                        /* (QEI_QEIIOC) Status of QEB input pin after polarity control and SWPAB pin swapping  */
#define QEI_QEIIOC_QEB_1                      (QEI_QEIIOC_QEB_1_Val << QEI_QEIIOC_QEB_Pos)         /* (QEI_QEIIOC) Status of QEB input pin after polarity control and SWPAB pin swapping Position  */
#define QEI_QEIIOC_QEB_0                      (QEI_QEIIOC_QEB_0_Val << QEI_QEIIOC_QEB_Pos)         /* (QEI_QEIIOC) Status of QEB input pin after polarity control and SWPAB pin swapping Position  */
#define QEI_QEIIOC_INDEX_Pos                  _UINT32_(2)                                          /* (QEI_QEIIOC) Status of INDXx Input Pin after Polarity Control bit Position */
#define QEI_QEIIOC_INDEX_Msk                  (_UINT32_(0x1) << QEI_QEIIOC_INDEX_Pos)              /* (QEI_QEIIOC) Status of INDXx Input Pin after Polarity Control bit Mask */
#define QEI_QEIIOC_INDEX(value)               (QEI_QEIIOC_INDEX_Msk & (_UINT32_(value) << QEI_QEIIOC_INDEX_Pos)) /* Assigment of value for INDEX in the QEI_QEIIOC register */
#define QEI_QEIIOC_HOME_Pos                   _UINT32_(3)                                          /* (QEI_QEIIOC) Status of HOMEx Input Pin after Polarity Control bit Position */
#define QEI_QEIIOC_HOME_Msk                   (_UINT32_(0x1) << QEI_QEIIOC_HOME_Pos)               /* (QEI_QEIIOC) Status of HOMEx Input Pin after Polarity Control bit Mask */
#define QEI_QEIIOC_HOME(value)                (QEI_QEIIOC_HOME_Msk & (_UINT32_(value) << QEI_QEIIOC_HOME_Pos)) /* Assigment of value for HOME in the QEI_QEIIOC register */
#define QEI_QEIIOC_QEAPOL_Pos                 _UINT32_(4)                                          /* (QEI_QEIIOC) QEAx Input Polarity Select bit Position */
#define QEI_QEIIOC_QEAPOL_Msk                 (_UINT32_(0x1) << QEI_QEIIOC_QEAPOL_Pos)             /* (QEI_QEIIOC) QEAx Input Polarity Select bit Mask */
#define QEI_QEIIOC_QEAPOL(value)              (QEI_QEIIOC_QEAPOL_Msk & (_UINT32_(value) << QEI_QEIIOC_QEAPOL_Pos)) /* Assigment of value for QEAPOL in the QEI_QEIIOC register */
#define   QEI_QEIIOC_QEAPOL_INVERT_Val        _UINT32_(0x1)                                        /* (QEI_QEIIOC) Input is inverted  */
#define   QEI_QEIIOC_QEAPOL_NORMAL_Val        _UINT32_(0x0)                                        /* (QEI_QEIIOC) Input is not inverted  */
#define QEI_QEIIOC_QEAPOL_INVERT              (QEI_QEIIOC_QEAPOL_INVERT_Val << QEI_QEIIOC_QEAPOL_Pos) /* (QEI_QEIIOC) Input is inverted Position  */
#define QEI_QEIIOC_QEAPOL_NORMAL              (QEI_QEIIOC_QEAPOL_NORMAL_Val << QEI_QEIIOC_QEAPOL_Pos) /* (QEI_QEIIOC) Input is not inverted Position  */
#define QEI_QEIIOC_QEBPOL_Pos                 _UINT32_(5)                                          /* (QEI_QEIIOC) QEBx Input Polarity Select bit Position */
#define QEI_QEIIOC_QEBPOL_Msk                 (_UINT32_(0x1) << QEI_QEIIOC_QEBPOL_Pos)             /* (QEI_QEIIOC) QEBx Input Polarity Select bit Mask */
#define QEI_QEIIOC_QEBPOL(value)              (QEI_QEIIOC_QEBPOL_Msk & (_UINT32_(value) << QEI_QEIIOC_QEBPOL_Pos)) /* Assigment of value for QEBPOL in the QEI_QEIIOC register */
#define   QEI_QEIIOC_QEBPOL_INVERT_Val        _UINT32_(0x1)                                        /* (QEI_QEIIOC) Input is inverted  */
#define   QEI_QEIIOC_QEBPOL_NORMAL_Val        _UINT32_(0x0)                                        /* (QEI_QEIIOC) Input is not inverted  */
#define QEI_QEIIOC_QEBPOL_INVERT              (QEI_QEIIOC_QEBPOL_INVERT_Val << QEI_QEIIOC_QEBPOL_Pos) /* (QEI_QEIIOC) Input is inverted Position  */
#define QEI_QEIIOC_QEBPOL_NORMAL              (QEI_QEIIOC_QEBPOL_NORMAL_Val << QEI_QEIIOC_QEBPOL_Pos) /* (QEI_QEIIOC) Input is not inverted Position  */
#define QEI_QEIIOC_IDXPOL_Pos                 _UINT32_(6)                                          /* (QEI_QEIIOC) INDXx Input Polarity Select bit Position */
#define QEI_QEIIOC_IDXPOL_Msk                 (_UINT32_(0x1) << QEI_QEIIOC_IDXPOL_Pos)             /* (QEI_QEIIOC) INDXx Input Polarity Select bit Mask */
#define QEI_QEIIOC_IDXPOL(value)              (QEI_QEIIOC_IDXPOL_Msk & (_UINT32_(value) << QEI_QEIIOC_IDXPOL_Pos)) /* Assigment of value for IDXPOL in the QEI_QEIIOC register */
#define   QEI_QEIIOC_IDXPOL_INVERT_Val        _UINT32_(0x1)                                        /* (QEI_QEIIOC) Input is inverted  */
#define   QEI_QEIIOC_IDXPOL_NORMAL_Val        _UINT32_(0x0)                                        /* (QEI_QEIIOC) Input is not inverted  */
#define QEI_QEIIOC_IDXPOL_INVERT              (QEI_QEIIOC_IDXPOL_INVERT_Val << QEI_QEIIOC_IDXPOL_Pos) /* (QEI_QEIIOC) Input is inverted Position  */
#define QEI_QEIIOC_IDXPOL_NORMAL              (QEI_QEIIOC_IDXPOL_NORMAL_Val << QEI_QEIIOC_IDXPOL_Pos) /* (QEI_QEIIOC) Input is not inverted Position  */
#define QEI_QEIIOC_HOMPOL_Pos                 _UINT32_(7)                                          /* (QEI_QEIIOC) HOMEx Input Polarity Select bit Position */
#define QEI_QEIIOC_HOMPOL_Msk                 (_UINT32_(0x1) << QEI_QEIIOC_HOMPOL_Pos)             /* (QEI_QEIIOC) HOMEx Input Polarity Select bit Mask */
#define QEI_QEIIOC_HOMPOL(value)              (QEI_QEIIOC_HOMPOL_Msk & (_UINT32_(value) << QEI_QEIIOC_HOMPOL_Pos)) /* Assigment of value for HOMPOL in the QEI_QEIIOC register */
#define   QEI_QEIIOC_HOMPOL_INVERT_Val        _UINT32_(0x1)                                        /* (QEI_QEIIOC) Input is inverted  */
#define   QEI_QEIIOC_HOMPOL_NORMAL_Val        _UINT32_(0x0)                                        /* (QEI_QEIIOC) Input is not inverted  */
#define QEI_QEIIOC_HOMPOL_INVERT              (QEI_QEIIOC_HOMPOL_INVERT_Val << QEI_QEIIOC_HOMPOL_Pos) /* (QEI_QEIIOC) Input is inverted Position  */
#define QEI_QEIIOC_HOMPOL_NORMAL              (QEI_QEIIOC_HOMPOL_NORMAL_Val << QEI_QEIIOC_HOMPOL_Pos) /* (QEI_QEIIOC) Input is not inverted Position  */
#define QEI_QEIIOC_SWPAB_Pos                  _UINT32_(8)                                          /* (QEI_QEIIOC) Swap QEA and QEB Inputs bit Position */
#define QEI_QEIIOC_SWPAB_Msk                  (_UINT32_(0x1) << QEI_QEIIOC_SWPAB_Pos)              /* (QEI_QEIIOC) Swap QEA and QEB Inputs bit Mask */
#define QEI_QEIIOC_SWPAB(value)               (QEI_QEIIOC_SWPAB_Msk & (_UINT32_(value) << QEI_QEIIOC_SWPAB_Pos)) /* Assigment of value for SWPAB in the QEI_QEIIOC register */
#define   QEI_QEIIOC_SWPAB_SWAP_Val           _UINT32_(0x1)                                        /* (QEI_QEIIOC) QEAx and QEBx are swapped prior to quadrature decoder logic  */
#define   QEI_QEIIOC_SWPAB_NORMAL_Val         _UINT32_(0x0)                                        /* (QEI_QEIIOC) QEAx and QEBx are not swapped  */
#define QEI_QEIIOC_SWPAB_SWAP                 (QEI_QEIIOC_SWPAB_SWAP_Val << QEI_QEIIOC_SWPAB_Pos)  /* (QEI_QEIIOC) QEAx and QEBx are swapped prior to quadrature decoder logic Position  */
#define QEI_QEIIOC_SWPAB_NORMAL               (QEI_QEIIOC_SWPAB_NORMAL_Val << QEI_QEIIOC_SWPAB_Pos) /* (QEI_QEIIOC) QEAx and QEBx are not swapped Position  */
#define QEI_QEIIOC_OUTFNC_Pos                 _UINT32_(9)                                          /* (QEI_QEIIOC) QEI Module Output Function Mode Select bits Position */
#define QEI_QEIIOC_OUTFNC_Msk                 (_UINT32_(0x3) << QEI_QEIIOC_OUTFNC_Pos)             /* (QEI_QEIIOC) QEI Module Output Function Mode Select bits Mask */
#define QEI_QEIIOC_OUTFNC(value)              (QEI_QEIIOC_OUTFNC_Msk & (_UINT32_(value) << QEI_QEIIOC_OUTFNC_Pos)) /* Assigment of value for OUTFNC in the QEI_QEIIOC register */
#define   QEI_QEIIOC_OUTFNC_EITHER_Val        _UINT32_(0x3)                                        /* (QEI_QEIIOC) The position coutner is either case  */
#define   QEI_QEIIOC_OUTFNC_LESS_THAN_Val     _UINT32_(0x2)                                        /* (QEI_QEIIOC) The position counter less than or equal to the range of CMPLH and CMPLL  */
#define   QEI_QEIIOC_OUTFNC_GREATER_THAN_Val  _UINT32_(0x1)                                        /* (QEI_QEIIOC) The position counter greater than or equal to the range of ICCH and ICCL  */
#define   QEI_QEIIOC_OUTFNC_DISABLE_Val       _UINT32_(0x0)                                        /* (QEI_QEIIOC) Output is disabled  */
#define QEI_QEIIOC_OUTFNC_EITHER              (QEI_QEIIOC_OUTFNC_EITHER_Val << QEI_QEIIOC_OUTFNC_Pos) /* (QEI_QEIIOC) The position coutner is either case Position  */
#define QEI_QEIIOC_OUTFNC_LESS_THAN           (QEI_QEIIOC_OUTFNC_LESS_THAN_Val << QEI_QEIIOC_OUTFNC_Pos) /* (QEI_QEIIOC) The position counter less than or equal to the range of CMPLH and CMPLL Position  */
#define QEI_QEIIOC_OUTFNC_GREATER_THAN        (QEI_QEIIOC_OUTFNC_GREATER_THAN_Val << QEI_QEIIOC_OUTFNC_Pos) /* (QEI_QEIIOC) The position counter greater than or equal to the range of ICCH and ICCL Position  */
#define QEI_QEIIOC_OUTFNC_DISABLE             (QEI_QEIIOC_OUTFNC_DISABLE_Val << QEI_QEIIOC_OUTFNC_Pos) /* (QEI_QEIIOC) Output is disabled Position  */
#define QEI_QEIIOC_QFDIV_Pos                  _UINT32_(11)                                         /* (QEI_QEIIOC) QEA/QEB/INDX/HOMEx Digital Input Filter Clock Divide Select bits Position */
#define QEI_QEIIOC_QFDIV_Msk                  (_UINT32_(0x7) << QEI_QEIIOC_QFDIV_Pos)              /* (QEI_QEIIOC) QEA/QEB/INDX/HOMEx Digital Input Filter Clock Divide Select bits Mask */
#define QEI_QEIIOC_QFDIV(value)               (QEI_QEIIOC_QFDIV_Msk & (_UINT32_(value) << QEI_QEIIOC_QFDIV_Pos)) /* Assigment of value for QFDIV in the QEI_QEIIOC register */
#define   QEI_QEIIOC_QFDIV_1_128_Val          _UINT32_(0x7)                                        /* (QEI_QEIIOC) 1:128 clock divide  */
#define   QEI_QEIIOC_QFDIV_1_64_Val           _UINT32_(0x6)                                        /* (QEI_QEIIOC) 1:64 clock divide  */
#define   QEI_QEIIOC_QFDIV_1_32_Val           _UINT32_(0x5)                                        /* (QEI_QEIIOC) 1:32 clock divide  */
#define   QEI_QEIIOC_QFDIV_1_16_Val           _UINT32_(0x4)                                        /* (QEI_QEIIOC) 1:16 clock divide  */
#define   QEI_QEIIOC_QFDIV_1_8_Val            _UINT32_(0x3)                                        /* (QEI_QEIIOC) 1:8 clock divide  */
#define   QEI_QEIIOC_QFDIV_1_4_Val            _UINT32_(0x2)                                        /* (QEI_QEIIOC) 1:4 clock divide  */
#define   QEI_QEIIOC_QFDIV_1_2_Val            _UINT32_(0x1)                                        /* (QEI_QEIIOC) 1:2 clock divide  */
#define   QEI_QEIIOC_QFDIV_1_1_Val            _UINT32_(0x0)                                        /* (QEI_QEIIOC) 1:1 clock divide  */
#define QEI_QEIIOC_QFDIV_1_128                (QEI_QEIIOC_QFDIV_1_128_Val << QEI_QEIIOC_QFDIV_Pos) /* (QEI_QEIIOC) 1:128 clock divide Position  */
#define QEI_QEIIOC_QFDIV_1_64                 (QEI_QEIIOC_QFDIV_1_64_Val << QEI_QEIIOC_QFDIV_Pos)  /* (QEI_QEIIOC) 1:64 clock divide Position  */
#define QEI_QEIIOC_QFDIV_1_32                 (QEI_QEIIOC_QFDIV_1_32_Val << QEI_QEIIOC_QFDIV_Pos)  /* (QEI_QEIIOC) 1:32 clock divide Position  */
#define QEI_QEIIOC_QFDIV_1_16                 (QEI_QEIIOC_QFDIV_1_16_Val << QEI_QEIIOC_QFDIV_Pos)  /* (QEI_QEIIOC) 1:16 clock divide Position  */
#define QEI_QEIIOC_QFDIV_1_8                  (QEI_QEIIOC_QFDIV_1_8_Val << QEI_QEIIOC_QFDIV_Pos)   /* (QEI_QEIIOC) 1:8 clock divide Position  */
#define QEI_QEIIOC_QFDIV_1_4                  (QEI_QEIIOC_QFDIV_1_4_Val << QEI_QEIIOC_QFDIV_Pos)   /* (QEI_QEIIOC) 1:4 clock divide Position  */
#define QEI_QEIIOC_QFDIV_1_2                  (QEI_QEIIOC_QFDIV_1_2_Val << QEI_QEIIOC_QFDIV_Pos)   /* (QEI_QEIIOC) 1:2 clock divide Position  */
#define QEI_QEIIOC_QFDIV_1_1                  (QEI_QEIIOC_QFDIV_1_1_Val << QEI_QEIIOC_QFDIV_Pos)   /* (QEI_QEIIOC) 1:1 clock divide Position  */
#define QEI_QEIIOC_FLTREN_Pos                 _UINT32_(14)                                         /* (QEI_QEIIOC) QEA/QEB/INDX/HOMEx Digital Filter Enable bit Position */
#define QEI_QEIIOC_FLTREN_Msk                 (_UINT32_(0x1) << QEI_QEIIOC_FLTREN_Pos)             /* (QEI_QEIIOC) QEA/QEB/INDX/HOMEx Digital Filter Enable bit Mask */
#define QEI_QEIIOC_FLTREN(value)              (QEI_QEIIOC_FLTREN_Msk & (_UINT32_(value) << QEI_QEIIOC_FLTREN_Pos)) /* Assigment of value for FLTREN in the QEI_QEIIOC register */
#define   QEI_QEIIOC_FLTREN_ON_Val            _UINT32_(0x1)                                        /* (QEI_QEIIOC) Input Pin Digital filter is enabled  */
#define   QEI_QEIIOC_FLTREN_OFF_Val           _UINT32_(0x0)                                        /* (QEI_QEIIOC) Input Pin Digital filter is disabled (bypassed)  */
#define QEI_QEIIOC_FLTREN_ON                  (QEI_QEIIOC_FLTREN_ON_Val << QEI_QEIIOC_FLTREN_Pos)  /* (QEI_QEIIOC) Input Pin Digital filter is enabled Position  */
#define QEI_QEIIOC_FLTREN_OFF                 (QEI_QEIIOC_FLTREN_OFF_Val << QEI_QEIIOC_FLTREN_Pos) /* (QEI_QEIIOC) Input Pin Digital filter is disabled (bypassed) Position  */
#define QEI_QEIIOC_QCAPEN_Pos                 _UINT32_(15)                                         /* (QEI_QEIIOC) Position Counter Input Capture Enable bit Position */
#define QEI_QEIIOC_QCAPEN_Msk                 (_UINT32_(0x1) << QEI_QEIIOC_QCAPEN_Pos)             /* (QEI_QEIIOC) Position Counter Input Capture Enable bit Mask */
#define QEI_QEIIOC_QCAPEN(value)              (QEI_QEIIOC_QCAPEN_Msk & (_UINT32_(value) << QEI_QEIIOC_QCAPEN_Pos)) /* Assigment of value for QCAPEN in the QEI_QEIIOC register */
#define   QEI_QEIIOC_QCAPEN_TRIGGERED_Val     _UINT32_(0x1)                                        /* (QEI_QEIIOC) Positive edge detect of Home input triggers position capture function  */
#define   QEI_QEIIOC_QCAPEN_NOT_TRIGGERED_Val _UINT32_(0x0)                                        /* (QEI_QEIIOC) Home input event (positive edge) does not trigger a capture even  */
#define QEI_QEIIOC_QCAPEN_TRIGGERED           (QEI_QEIIOC_QCAPEN_TRIGGERED_Val << QEI_QEIIOC_QCAPEN_Pos) /* (QEI_QEIIOC) Positive edge detect of Home input triggers position capture function Position  */
#define QEI_QEIIOC_QCAPEN_NOT_TRIGGERED       (QEI_QEIIOC_QCAPEN_NOT_TRIGGERED_Val << QEI_QEIIOC_QCAPEN_Pos) /* (QEI_QEIIOC) Home input event (positive edge) does not trigger a capture even Position  */
#define QEI_QEIIOC_HCAPEN_Pos                 _UINT32_(16)                                         /* (QEI_QEIIOC) Position Counter Input Capture by Home Event Enable bit Position */
#define QEI_QEIIOC_HCAPEN_Msk                 (_UINT32_(0x1) << QEI_QEIIOC_HCAPEN_Pos)             /* (QEI_QEIIOC) Position Counter Input Capture by Home Event Enable bit Mask */
#define QEI_QEIIOC_HCAPEN(value)              (QEI_QEIIOC_HCAPEN_Msk & (_UINT32_(value) << QEI_QEIIOC_HCAPEN_Pos)) /* Assigment of value for HCAPEN in the QEI_QEIIOC register */
#define   QEI_QEIIOC_HCAPEN_TRIGGERED_Val     _UINT32_(0x1)                                        /* (QEI_QEIIOC) HOMEx input event (positive edge) triggers a position capture event  */
#define   QEI_QEIIOC_HCAPEN_NOT_TRIGGERED_Val _UINT32_(0x0)                                        /* (QEI_QEIIOC) HOMEx input event (positive edge) does not trigger a position capture event  */
#define QEI_QEIIOC_HCAPEN_TRIGGERED           (QEI_QEIIOC_HCAPEN_TRIGGERED_Val << QEI_QEIIOC_HCAPEN_Pos) /* (QEI_QEIIOC) HOMEx input event (positive edge) triggers a position capture event Position  */
#define QEI_QEIIOC_HCAPEN_NOT_TRIGGERED       (QEI_QEIIOC_HCAPEN_NOT_TRIGGERED_Val << QEI_QEIIOC_HCAPEN_Pos) /* (QEI_QEIIOC) HOMEx input event (positive edge) does not trigger a position capture event Position  */
#define QEI_QEIIOC_Msk                        _UINT32_(0x0001FFFF)                                 /* (QEI_QEIIOC) Register Mask  */


