Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/qei.h
#define QEI_QEISTATCLR_Msk                    _UINT32_(0x00000000)                                 /* (QEI_QEISTATCLR) Register Mask  */


/* -------- QEI_QEISTATSET : (QEI Offset: 0x28) (R/W 32) Bit set register -------- */
#define QEI_QEISTATSET_RESETVALUE             _UINT32_(0x00)                                       /*  (QEI_QEISTATSET) Bit set register  Reset Value */

#define QEI_QEISTATSET_Msk                    _UINT32_(0x00000000)                                 /* (QEI_QEISTATSET) Register Mask  */


/* -------- QEI_QEISTATINV : (QEI Offset: 0x2C) (R/W 32) Bit invert register -------- */
#define QEI_QEISTATINV_RESETVALUE             _UINT32_(0x00)                                       /*  (QEI_QEISTATINV) Bit invert register  Reset Value */

#define QEI_QEISTATINV_Msk                    _UINT32_(0x00000000)                                 /* (QEI_QEISTATINV) Register Mask  */


/* -------- QEI_POSCNT : (QEI Offset: 0x30) (R/W 32) Position Counter Register -------- */
#define QEI_POSCNT_POSCNT_Pos                 _UINT32_(0)                                          /* (QEI_POSCNT) Position Counter Position */
#define QEI_POSCNT_POSCNT_Msk                 (_UINT32_(0xFFFFFFFF) << QEI_POSCNT_POSCNT_Pos)      /* (QEI_POSCNT) Position Counter Mask */
#define QEI_POSCNT_POSCNT(value)              (QEI_POSCNT_POSCNT_Msk & (_UINT32_(value) << QEI_POSCNT_POSCNT_Pos)) /* Assigment of value for POSCNT in the QEI_POSCNT register */
#define QEI_POSCNT_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (QEI_POSCNT) Register Mask  */


/* -------- QEI_POSCNTCLR : (QEI Offset: 0x34) (R/W 32) Bit clear register -------- */
#define QEI_POSCNTCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_POSCNTCLR) Bit clear register  Reset Value */

#define QEI_POSCNTCLR_Msk                     _UINT32_(0x00000000)                                 /* (QEI_POSCNTCLR) Register Mask  */


/* -------- QEI_POSCNTSET : (QEI Offset: 0x38) (R/W 32) Bit set register -------- */
#define QEI_POSCNTSET_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_POSCNTSET) Bit set register  Reset Value */

#define QEI_POSCNTSET_Msk                     _UINT32_(0x00000000)                                 /* (QEI_POSCNTSET) Register Mask  */


/* -------- QEI_POSCNTINV : (QEI Offset: 0x3C) (R/W 32) Bit invert register -------- */
#define QEI_POSCNTINV_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_POSCNTINV) Bit invert register  Reset Value */

#define QEI_POSCNTINV_Msk                     _UINT32_(0x00000000)                                 /* (QEI_POSCNTINV) Register Mask  */


/* -------- QEI_POSHLD : (QEI Offset: 0x40) (R/W 32) Position Count Hold Register -------- */
#define QEI_POSHLD_POSHLD_Pos                 _UINT32_(0)                                          /* (QEI_POSHLD) Position Count Hold Position */
#define QEI_POSHLD_POSHLD_Msk                 (_UINT32_(0xFFFFFFFF) << QEI_POSHLD_POSHLD_Pos)      /* (QEI_POSHLD) Position Count Hold Mask */
#define QEI_POSHLD_POSHLD(value)              (QEI_POSHLD_POSHLD_Msk & (_UINT32_(value) << QEI_POSHLD_POSHLD_Pos)) /* Assigment of value for POSHLD in the QEI_POSHLD register */
#define QEI_POSHLD_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (QEI_POSHLD) Register Mask  */


/* -------- QEI_POSHLDCLR : (QEI Offset: 0x44) (R/W 32) Bit clear register -------- */
#define QEI_POSHLDCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_POSHLDCLR) Bit clear register  Reset Value */

#define QEI_POSHLDCLR_Msk                     _UINT32_(0x00000000)                                 /* (QEI_POSHLDCLR) Register Mask  */


/* -------- QEI_POSHLDSET : (QEI Offset: 0x48) (R/W 32) Bit set register -------- */
#define QEI_POSHLDSET_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_POSHLDSET) Bit set register  Reset Value */

#define QEI_POSHLDSET_Msk                     _UINT32_(0x00000000)                                 /* (QEI_POSHLDSET) Register Mask  */


/* -------- QEI_POSHLDINV : (QEI Offset: 0x4C) (R/W 32) Bit invert register -------- */
#define QEI_POSHLDINV_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_POSHLDINV) Bit invert register  Reset Value */

#define QEI_POSHLDINV_Msk                     _UINT32_(0x00000000)                                 /* (QEI_POSHLDINV) Register Mask  */


/* -------- QEI_VELCNT : (QEI Offset: 0x50) (R/W 32) Velocity Counter Register -------- */
#define QEI_VELCNT_VELCNT_Pos                 _UINT32_(0)                                          /* (QEI_VELCNT) Velocity Counter Position */
#define QEI_VELCNT_VELCNT_Msk                 (_UINT32_(0xFFFFFFFF) << QEI_VELCNT_VELCNT_Pos)      /* (QEI_VELCNT) Velocity Counter Mask */
#define QEI_VELCNT_VELCNT(value)              (QEI_VELCNT_VELCNT_Msk & (_UINT32_(value) << QEI_VELCNT_VELCNT_Pos)) /* Assigment of value for VELCNT in the QEI_VELCNT register */
#define QEI_VELCNT_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (QEI_VELCNT) Register Mask  */


/* -------- QEI_VELCNTCLR : (QEI Offset: 0x54) (R/W 32) Bit clear register -------- */
#define QEI_VELCNTCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_VELCNTCLR) Bit clear register  Reset Value */

#define QEI_VELCNTCLR_Msk                     _UINT32_(0x00000000)                                 /* (QEI_VELCNTCLR) Register Mask  */


/* -------- QEI_VELCNTSET : (QEI Offset: 0x58) (R/W 32) Bit set register -------- */
#define QEI_VELCNTSET_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_VELCNTSET) Bit set register  Reset Value */

#define QEI_VELCNTSET_Msk                     _UINT32_(0x00000000)                                 /* (QEI_VELCNTSET) Register Mask  */


/* -------- QEI_VELCNTINV : (QEI Offset: 0x5C) (R/W 32) Bit invert register -------- */
#define QEI_VELCNTINV_RESETVALUE              _UINT32_(0x00)                                       /*  (QEI_VELCNTINV) Bit invert register  Reset Value */

#define QEI_VELCNTINV_Msk                     _UINT32_(0x00000000)                                 /* (QEI_VELCNTINV) Register Mask  */


